app/views/recipes/index.html.erb

SELECT "recipes".* FROM "recipes"
---

<% @user.recipes.each do |recipe| %>