app/controllers/recipes_controller.rb

  def index
    if user_signed_in?
    @recipes = Recipe.all
---
SELECT "recipes".* FROM "recipes"

  def create
    @recipe = current_user.recipes.create(recipe_params)
    @recipe.save
---
INSERT INTO "recipes" ("creator_id", "course_id", "difficulty", "prep_time", "name", "directions", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "users" SET "main_course_time" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["main_course_time", 2016-10-28 21:21:56 UTC], ["updated_at", 2016-10-28 21:21:56 UTC], ["id", 3]]

  def new
    @ingredients = (Ingredient.all).order(:name)
    @course = Course.find(params[:course_id])
---
SELECT "ingredients".* FROM "ingredients" ORDER BY "ingredients"."name" ASC
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @recipe = Recipe.update(recipe_params)
---
UPDATE "recipes" SET "name" = $1, "difficulty" = $2, "prep_time" = $3, "directions" = $4, "updated_at" = $5 WHERE "recipes"."id" = $6  [["name", "Pasta"], ["difficulty", 1], ["prep_time", 20], ["directions", "asdf"], ["updated_at", 2016-10-28 18:39:50 UTC], ["id", 2]]